AlexMel83/Esp32-data-logging-Firebase2/src/main.cpp
#include "config.h"
#include <Arduino.h>
#include "SPIFFS.h"
#include <WiFi.h>
#include <WebServer.h>
#include <ESP8266FtpServer.h>
#include <Firebase_ESP_Client.h>
#include "routes.h"
#include "time.h"
#include <vector>
#include <algorithm>

#include "addons/TokenHelper.h"
#include "addons/RTDBHelper.h"

// Определяем DEBUG_PRINT в самом начале
#define DEBUG // Можно закомментировать, чтобы отключить отладку
#ifdef DEBUG
  #define DEBUG_PRINT(x) do { if (Serial) Serial.println(x); } while (0)
#else
  #define DEBUG_PRINT(x)
#endif

// Define servers
WebServer http(80);
FtpServer ftpSrv;

// Define Firebase objects
FirebaseData fbdo;
FirebaseAuth auth;
FirebaseConfig config;

// Variable to save USER UID
String uid;

// Structure to hold counter event data
struct CounterEvent {
  int counterId;
  unsigned long timestamp;
};

// Queue for counter events
#define QUEUE_SIZE 50 // Уменьшено для экономии памяти
CounterEvent eventQueue[QUEUE_SIZE];
volatile int queueHead = 0;
volatile int queueTail = 0;

// Counter values
volatile int counter1Value;
volatile int counter2Value;
volatile int counter3Value;

// Флаги для обработки событий в loop()
volatile bool counter1Triggered = false;
volatile bool counter2Triggered = false;
volatile bool counter3Triggered = false;

// Pin definitions
const int COUNTER1_PIN = 14; // Увеличивает counter1
const int COUNTER2_PIN = 26; // Увеличивает counter2
const int COUNTER3_PIN = 27; // Увеличивает counter3
const int RESET1_PIN = 32;   // Сбрасывает counter1
const int RESET2_PIN = 33;   // Сбрасывает counter2
const int RESET3_PIN = 25;   // Сбрасывает counter3
const int LED_PIN = 2;

// Wi-Fi LED blink variables
unsigned long lastBlinkMillis = 0;
const unsigned long blinkInterval = 1000;
bool ledState = false;

// Debounce variables
unsigned long lastResetTime1 = 0; // Для сброса
unsigned long lastResetTime2 = 0;
unsigned long lastResetTime3 = 0;
const unsigned long debounceDelay = 500; // Увеличено до 500 мс

// Timer variables
unsigned long sendDataPrevMillis = 0;
unsigned long timerDelay = 15000; // Увеличено до 15 секунд
const unsigned long firebaseWriteInterval = 1000; // Минимальный интервал между запросами (1 секунда)
unsigned long lastFirebaseWrite = 0;

const char* ntpServer = "pool.ntp.org";
const long gmtOffset_sec = 7200;  // UTC+2 для Украины
const int daylightOffset_sec = 0;

// Variables for time synchronization
volatile unsigned long currentTimestamp = 0;
unsigned long lastSyncTime = 0;
unsigned long lastSyncMillis = 0;

// Interrupt Service Routines with debounce
void IRAM_ATTR counter1ISR() {
  static unsigned long lastTrigger = 0;
  unsigned long currentMillis = millis();
  if (currentMillis - lastTrigger > debounceDelay) {
    counter1Triggered = true;
    lastTrigger = currentMillis;
  }
}

void IRAM_ATTR counter2ISR() {
  static unsigned long lastTrigger = 0;
  unsigned long currentMillis = millis();
  if (currentMillis - lastTrigger > debounceDelay) {
    counter2Triggered = true;
    lastTrigger = currentMillis;
  }
}

void IRAM_ATTR counter3ISR() {
  static unsigned long lastTrigger = 0;
  unsigned long currentMillis = millis();
  if (currentMillis - lastTrigger > debounceDelay) {
    counter3Triggered = true;
    lastTrigger = currentMillis;
  }
}

// Функция для обработки событий счетчиков
void processCounterEvent(int counterId, volatile int& counterValue) {
  counterValue++;
  DEBUG_PRINT("Counter" + String(counterId) + " incremented: " + String(counterValue));
  int queueSize = (queueTail >= queueHead) ? (queueTail - queueHead) : (queueTail + QUEUE_SIZE - queueHead);
  if (queueSize >= QUEUE_SIZE * 0.9) { // Если очередь заполнена на 90%
    DEBUG_PRINT("Queue almost full (" + String(queueSize) + "/" + String(QUEUE_SIZE) + "), event for counter " + String(counterId) + " dropped");
    return;
  }
  int nextTail = (queueTail + 1) % QUEUE_SIZE;
  if (nextTail != queueHead) {
    eventQueue[queueTail].counterId = counterId;
    eventQueue[queueTail].timestamp = currentTimestamp;
    queueTail = nextTail;
    DEBUG_PRINT("Event added to queue for counter " + String(counterId));
  } else {
    DEBUG_PRINT("Queue full, event for counter " + String(counterId) + " dropped");
  }
}

// Initialize WiFi с явным указанием DNS
void initWiFi() {
  IPAddress primaryDNS(8, 8, 8, 8);   // Google DNS 1
  IPAddress secondaryDNS(8, 8, 4, 4); // Google DNS 2
  WiFi.config(local_ip, gateway, subnet, primaryDNS, secondaryDNS);
  WiFi.begin(WIFI_SSID, WIFI_PASSWORD);
  DEBUG_PRINT("Connecting to WiFi ..");
  
  unsigned long startAttemptTime = millis();
  const unsigned long wifiTimeout = 60000; // Увеличено до 60 секунд

  while (WiFi.status() != WL_CONNECTED && millis() - startAttemptTime < wifiTimeout) {
    if (millis() - lastBlinkMillis >= blinkInterval) {
      ledState = !ledState;
      digitalWrite(LED_PIN, ledState);
      lastBlinkMillis = millis();
    }
  }

  if (WiFi.status() == WL_CONNECTED) {
    DEBUG_PRINT("");
    DEBUG_PRINT(WiFi.localIP().toString());
    DEBUG_PRINT("WiFi connected");
    digitalWrite(LED_PIN, HIGH);
  } else {
    DEBUG_PRINT("");
    DEBUG_PRINT("Failed to connect to WiFi, restarting...");
    digitalWrite(LED_PIN, LOW);
    delay(1000);
    ESP.restart();
  }
}

// Function to get formatted time string
String getFormattedTime(unsigned long epochTime) {
  struct tm *ptm = localtime((time_t *)&epochTime);
  char buffer[20];
  sprintf(buffer, "%04d-%02d-%02d %02d:%02d:%02d",
          ptm->tm_year + 1900, ptm->tm_mon + 1, ptm->tm_mday,
          ptm->tm_hour, ptm->tm_min, ptm->tm_sec);
  return String(buffer);
}

// Function that gets current epoch time
unsigned long getTime() {
  time_t now;
  struct tm timeinfo;
  if (!getLocalTime(&timeinfo)) {
    DEBUG_PRINT("Failed to obtain time");
    return 0;
  }
  time(&now);
  return now;
}

// Функция для очистки старых пачек событий
void cleanupOldEvents(String path, int maxBatches) {
  if (Firebase.RTDB.getJSON(&fbdo, path.c_str())) {
    FirebaseJson* json = fbdo.jsonObjectPtr();
    size_t count = json->iteratorBegin();
    if (count > maxBatches) {
      std::vector<String> keys;
      for (size_t i = 0; i < count; i++) {
        String key, value;
        int type;
        json->iteratorGet(i, type, key, value);
        keys.push_back(key);
      }
      std::sort(keys.begin(), keys.end());
      for (size_t i = 0; i < count - maxBatches; i++) {
        String batchPath = path + "/" + keys[i];
        Firebase.RTDB.deleteNode(&fbdo, batchPath.c_str());
        DEBUG_PRINT("Deleted old batch: " + batchPath);
      }
    }
    json->iteratorEnd();
    json->clear();
  }
}

void setup() {
  #ifdef DEBUG
    Serial.begin(115200);
  #endif

