AlexMel83/Esp32-data-logging-Firebase2/src/main.cpp
  pinMode(COUNTER1_PIN, INPUT_PULLUP);
  pinMode(COUNTER2_PIN, INPUT_PULLUP);
  pinMode(COUNTER3_PIN, INPUT_PULLUP);
  pinMode(RESET1_PIN, INPUT_PULLUP);
  pinMode(RESET2_PIN, INPUT_PULLUP);
  pinMode(RESET3_PIN, INPUT_PULLUP);
  pinMode(LED_PIN, OUTPUT);
  digitalWrite(LED_PIN, LOW);

  // Проверяем, запустилась ли плата корректно
  unsigned long startTime = millis();
  delay(100);
  if (millis() - startTime < 50) { // Если время не прошло, значит плата зависла
    DEBUG_PRINT("Setup failed to progress, restarting...");
    ESP.restart();
  }

  DEBUG_PRINT("Setting up interrupts...");
  attachInterrupt(digitalPinToInterrupt(COUNTER1_PIN), counter1ISR, FALLING);
  attachInterrupt(digitalPinToInterrupt(COUNTER2_PIN), counter2ISR, FALLING);
  attachInterrupt(digitalPinToInterrupt(COUNTER3_PIN), counter3ISR, FALLING);
  DEBUG_PRINT("Interrupts set up");

  DEBUG_PRINT("Initializing WiFi...");
  initWiFi();

  if (WiFi.status() != WL_CONNECTED) {
    DEBUG_PRINT("WiFi failed to initialize, restarting...");
    ESP.restart(); // Программный сброс
  }

  DEBUG_PRINT("Configuring time...");
  configTime(gmtOffset_sec, daylightOffset_sec, ntpServer);

  unsigned long ntpTimeout = millis();
  while (currentTimestamp == 0 && millis() - ntpTimeout < 10000) {
    currentTimestamp = getTime();
    if (currentTimestamp == 0) {
      DEBUG_PRINT("Waiting for NTP sync...");
      delay(1000);
    } else {
      String message = "Time synced: ";
      message.concat(getFormattedTime(currentTimestamp));
      DEBUG_PRINT(message);
    }
  }
  if (currentTimestamp == 0) {
    DEBUG_PRINT("NTP sync failed, using hardcoded time for testing");
    currentTimestamp = 1743255292;
  }
  lastSyncTime = currentTimestamp;
  lastSyncMillis = millis();

  DEBUG_PRINT("Mounting SPIFFS...");
  if (!SPIFFS.begin(true)) {
    DEBUG_PRINT("SPIFFS Mount Failed");
    while (true) {
      digitalWrite(LED_PIN, HIGH); // Индикация ошибки
      delay(500);
      digitalWrite(LED_PIN, LOW);
      delay(500);
    }
  }
  DEBUG_PRINT("SPIFFS Mounted successfully");

  config.api_key = API_KEY;
  config.database_url = DATABASE_URL;
  config.token_status_callback = tokenStatusCallback;
  config.max_token_generation_retry = 5;
  config.timeout.serverResponse = 30000; // Увеличено до 30 секунд
  config.timeout.wifiReconnect = 15000;  // Увеличено до 15 секунд

  auth.user.email = USER_EMAIL;
  auth.user.password = USER_PASSWORD;

  Firebase.reconnectWiFi(true);
  fbdo.setResponseSize(16384); // Увеличено до 16 КБ

  DEBUG_PRINT("Initializing Firebase...");
  Firebase.begin(&config, &auth);

  DEBUG_PRINT("Getting User UID...");
  unsigned long uidTimeout = millis();
  while (auth.token.uid == "" && millis() - uidTimeout < 30000) {
    delay(100);
  }
  if (auth.token.uid == "") {
    DEBUG_PRINT("Failed to get UID, proceeding with empty UID");
  } else {
    uid = auth.token.uid.c_str();
    String uidMessage = "User UID: ";
    uidMessage.concat(uid);
    DEBUG_PRINT(uidMessage);
  }

  // Тестовая запись в Firebase и инициализация счетчиков
  if (Firebase.ready()) {
    FirebaseJson testJson;
    testJson.set("counterValue", 42);
    if (Firebase.RTDB.setJSON(&fbdo, "/UsersData/" + uid + "/test", &testJson)) {
      DEBUG_PRINT("Test data written successfully");
    } else {
      DEBUG_PRINT("Failed to write test data: " + fbdo.errorReason());
    }

    // Инициализация счетчиков, если данных нет
    for (int i = 1; i <= 3; i++) {
      String path = "/UsersData/" + uid + "/count-" + String(i);
      if (!Firebase.RTDB.pathExisted(&fbdo, path.c_str())) {
        FirebaseJson initJson;
        FirebaseJson eventData;
        eventData.set("counterValue", 0);
        initJson.set(String(currentTimestamp), eventData);
        String initPath = path + "/" + String(currentTimestamp);
        if (Firebase.RTDB.setJSON(&fbdo, initPath.c_str(), &initJson)) {
          DEBUG_PRINT("Initialized counter" + String(i) + " with 0");
        } else {
          DEBUG_PRINT("Failed to initialize counter" + String(i) + ": " + fbdo.errorReason());
        }
      }
    }
  }

  // Загрузка последних значений счетчиков из Firebase
  if (WiFi.status() == WL_CONNECTED && Firebase.ready()) {
    const int maxAttempts = 5;
    int attempt = 0;

    while (attempt < maxAttempts) {
      attempt++;
      DEBUG_PRINT("Attempt " + String(attempt) + " to load counters from Firebase...");

      int values[3] = {0, 0, 0}; // Для хранения значений счетчиков
      bool allFailed = true;

      // Загружаем данные для каждого счетчика
      for (int i = 0; i < 3; i++) {
        String path = "/UsersData/" + uid + "/count-" + String(i + 1);
        FirebaseData queryFbdo;

        // Настраиваем QueryFilter для получения последней порции
        QueryFilter query;
        query.orderBy("$key"); // Сортируем по ключам (временным меткам)
        query.limitToLast(1);  // Берем только последнюю порцию

        if (Firebase.RTDB.getJSON(&queryFbdo, path.c_str(), &query)) {
          if (queryFbdo.dataType() == "json") {
            FirebaseJson* json = queryFbdo.jsonObjectPtr();
            size_t batchCount = json->iteratorBegin();
            if (batchCount > 0) {
              unsigned long latestTimestamp = 0;
              int lastValue = 0;

              // Получаем последнюю порцию
              String batchKey, batchValue;
              int type;
              json->iteratorGet(0, type, batchKey, batchValue);

              // Получаем содержимое порции
              FirebaseJson batchJson;
              batchJson.setJsonData(batchValue);
              size_t eventCount = batchJson.iteratorBegin();

              // Проходим по всем событиям в порции, чтобы найти последнее
              for (size_t k = 0; k < eventCount; k++) {
                String eventKey, eventValue;
                int eventType;
                batchJson.iteratorGet(k, eventType, eventKey, eventValue);

                // Преобразуем ключ (временную метку) в число
                unsigned long eventTimestamp = eventKey.toInt();
                if (eventTimestamp > latestTimestamp) {
                  FirebaseJsonData result;
                  batchJson.get(result, eventKey + "/counterValue");
                  if (result.success) {
                    latestTimestamp = eventTimestamp;
                    lastValue = result.to<int>();
                  }
                }
              }
              batchJson.iteratorEnd();
              batchJson.clear();

