AlexMel83/Esp32-data-logging-Firebase2/src/main.cpp
              values[i] = lastValue;
              DEBUG_PRINT("Loaded last value for counter" + String(i + 1) + ": " + String(lastValue));
              allFailed = false;
            } else {
              DEBUG_PRINT("No data for counter" + String(i + 1) + ", using 0");
            }
            json->iteratorEnd();
            json->clear();
          } else {
            DEBUG_PRINT("Unexpected data type for counter" + String(i + 1) + ": " + queryFbdo.dataType());
          }
        } else {
          String errorReason = queryFbdo.errorReason();
          if (errorReason == "") errorReason = "Unknown error";
          DEBUG_PRINT("Failed to load " + path + ": " + errorReason + ", using 0");
        }

        // Очищаем QueryFilter после использования
        query.clear();
      }

      if (!allFailed) {
        counter1Value = values[0];
        counter2Value = values[1];
        counter3Value = values[2];
        DEBUG_PRINT("Counters set to: c1=" + String(counter1Value) + ", c2=" + String(counter2Value) + ", c3=" + String(counter3Value));
        break;
      } else {
        DEBUG_PRINT("All counters failed, retrying...");
        delay(2000);
        Firebase.reconnectWiFi(true);
      }
    }

    if (attempt >= maxAttempts) {
      DEBUG_PRINT("Max attempts reached, setting counters to 0");
      counter1Value = 0;
      counter2Value = 0;
      counter3Value = 0;
    }
  } else {
    DEBUG_PRINT("No WiFi or Firebase not ready, counters set to 0");
    counter1Value = 0;
    counter2Value = 0;
    counter3Value = 0;
  }

  http.begin();
  ftpSrv.begin("relay", "relay");
  String msg = "FTP server started @ ";
  msg.concat(WiFi.localIP().toString());
  DEBUG_PRINT(msg);
  DEBUG_PRINT("Server listening");

  setupRoutes();
}

void loop() {
  // Обрабатываем события счетчиков
  if (counter1Triggered) {
    noInterrupts();
    counter1Triggered = false;
    interrupts();
    processCounterEvent(1, counter1Value);
  }
  if (counter2Triggered) {
    noInterrupts();
    counter2Triggered = false;
    interrupts();
    processCounterEvent(2, counter2Value);
  }
  if (counter3Triggered) {
    noInterrupts();
    counter3Triggered = false;
    interrupts();
    processCounterEvent(3, counter3Value);
  }

  http.handleClient();
  ftpSrv.handleFTP();

  if (WiFi.status() == WL_CONNECTED) {
    if (millis() - lastBlinkMillis >= blinkInterval) {
      ledState = !ledState;
      digitalWrite(LED_PIN, ledState);
      lastBlinkMillis = millis();
    }
  } else {
    if (millis() - lastBlinkMillis >= 100) {
      ledState = !ledState;
      digitalWrite(LED_PIN, ledState);
      lastBlinkMillis = millis();
    }
    DEBUG_PRINT("WiFi disconnected, attempting to reconnect...");
    initWiFi();
    Firebase.reconnectWiFi(true);
  }

  // Обработка пинов сброса
  int resetPins[3] = {RESET1_PIN, RESET2_PIN, RESET3_PIN};
  volatile int* counters[3] = {&counter1Value, &counter2Value, &counter3Value};
  unsigned long lastResetTimes[3] = {lastResetTime1, lastResetTime2, lastResetTime3};

  for (int i = 0; i < 3; i++) {
    if (digitalRead(resetPins[i]) == LOW && millis() - lastResetTimes[i] > debounceDelay) {
      DEBUG_PRINT("Reset triggered for counter " + String(i + 1) + " on pin " + String(resetPins[i]));
      if (*counters[i] > 0) {
        String storyPath = "/UsersData/" + uid + "/count_story/count-" + String(i + 1) + "/" + String(currentTimestamp);
        FirebaseJson json;
        json.set("counterValue", *counters[i]);

        if (WiFi.status() == WL_CONNECTED && Firebase.ready()) {
          DEBUG_PRINT("Writing to count_story: " + storyPath);
          if (Firebase.RTDB.setJSON(&fbdo, storyPath.c_str(), &json)) {
            DEBUG_PRINT("Count story updated successfully for counter" + String(i + 1));
            *counters[i] = 0;
            DEBUG_PRINT("Counter" + String(i + 1) + " reset to 0");

            // Записываем событие с нулевым значением в count-X
            String eventPath = "/UsersData/" + uid + "/count-" + String(i + 1) + "/" + String(currentTimestamp);
            FirebaseJson resetJson;
            FirebaseJson eventData;
            eventData.set("counterValue", 0);
            resetJson.set(String(currentTimestamp), eventData);
            if (Firebase.RTDB.setJSON(&fbdo, eventPath.c_str(), &resetJson)) {
              DEBUG_PRINT("Reset event written to: " + eventPath);
            } else {
              DEBUG_PRINT("Failed to write reset event: " + fbdo.errorReason());
            }
          } else {
            DEBUG_PRINT("Failed to update count_story: " + fbdo.errorReason());
          }
        } else {
          DEBUG_PRINT("WiFi or Firebase not ready, skipping count_story write");
        }
        json.clear();
      }
      lastResetTimes[i] = millis();
    }
  }
  lastResetTime1 = lastResetTimes[0];
  lastResetTime2 = lastResetTimes[1];
  lastResetTime3 = lastResetTimes[2];

  if (millis() - lastSyncMillis >= 3600000) {
    unsigned long ntpTime = getTime();
    if (ntpTime != 0) {
      noInterrupts();
      currentTimestamp = ntpTime;
      interrupts();
      lastSyncTime = currentTimestamp;
      lastSyncMillis = millis();
      String message = "Time resynced: ";
      message.concat(getFormattedTime(currentTimestamp));
      DEBUG_PRINT(message);
    }
  } else if (millis() - lastSyncMillis >= 1000) {
    noInterrupts();
    currentTimestamp++;
    interrupts();
    lastSyncMillis = millis();
  }

  // Очистка старых данных раз в час
  static unsigned long lastCleanup = 0;
  if (millis() - lastCleanup >= 3600000) { // Раз в час
    for (int i = 1; i <= 3; i++) {
      String path = "/UsersData/" + uid + "/count-" + String(i);
      cleanupOldEvents(path, 10); // Храним только последние 10 пачек (по 10 событий = 100 событий)
    }
    lastCleanup = millis();
  }

  // Обработка очереди событий
  if (Firebase.ready() && (millis() - sendDataPrevMillis > timerDelay || sendDataPrevMillis == 0)) {
    if (millis() - lastFirebaseWrite < firebaseWriteInterval) {
      return; // Пропускаем, если прошло меньше 1 секунды с последнего запроса
    }
    sendDataPrevMillis = millis();

    // Проверяем статус токена
    if (!Firebase.ready()) {
      DEBUG_PRINT("Firebase not ready, attempting to re-authenticate...");
      Firebase.reconnectWiFi(true);
      Firebase.begin(&config, &auth);
    }

    static bool queueEmptyLogged = false;
    if (queueHead == queueTail && !queueEmptyLogged) {
      String queueStatus = "Queue head: ";
      queueStatus.concat(String(queueHead));
      queueStatus.concat(", tail: ");
      queueStatus.concat(String(queueTail));
      DEBUG_PRINT(queueStatus);
      queueEmptyLogged = true;
    }

