AlexMel83/Esp32-data-logging-Firebase2/src/main.cpp
    static int maxQueueAttempts = 5; // Максимальное количество попыток обработки очереди
    static int queueAttempts = 0;

    const int batchSize = 10; // Максимальный размер порции (10 событий за раз)
    while (queueHead != queueTail) {
      queueEmptyLogged = false;
      String queueStatus = "Queue head: ";
      queueStatus.concat(String(queueHead));
      queueStatus.concat(", tail: ");
      queueStatus.concat(String(queueTail));
      DEBUG_PRINT(queueStatus);

      // Проверяем количество попыток обработки очереди
      queueAttempts++;
      if (queueAttempts >= maxQueueAttempts) {
        DEBUG_PRINT("Max queue attempts reached, clearing queue to prevent infinite loop");
        noInterrupts();
        queueHead = queueTail; // Очищаем очередь
        queueAttempts = 0;
        interrupts();
        break;
      }

      // Проверяем, что UID не пустой
      if (uid == "") {
        DEBUG_PRINT("UID is empty, cannot write to Firebase");
        break;
      }

      // Создаем массивы для группировки событий по счетчикам
      FirebaseJson batchData[3]; // Один JSON для каждого счетчика (count-1, count-2, count-3)
      unsigned long batchTimestamps[3] = {0, 0, 0}; // Временная метка первой записи в пачке для каждого счетчика
      int eventsProcessed = 0;

      // Обрабатываем события порцией
      while (queueHead != queueTail && eventsProcessed < batchSize) {
        CounterEvent event;
        noInterrupts();
        event = eventQueue[queueHead];
        queueHead = (queueHead + 1) % QUEUE_SIZE;
        interrupts();

        DEBUG_PRINT("Processing event for counter " + String(event.counterId) + " at timestamp " + String(event.timestamp));

        // Определяем индекс счетчика (0 для count-1, 1 для count-2, 2 для count-3)
        int counterIndex = event.counterId - 1;

        // Если это первое событие в пачке, сохраняем временную метку
        if (batchTimestamps[counterIndex] == 0) {
          batchTimestamps[counterIndex] = event.timestamp;
        }

        // Создаем JSON-объект для события
        FirebaseJson eventData;
        eventData.set("counterValue", (event.counterId == 1) ? counter1Value : 
                                      (event.counterId == 2) ? counter2Value : counter3Value);

        // Добавляем событие в batchData с временной меткой как ключом
        String eventKey = String(event.timestamp);
        batchData[counterIndex].set(eventKey, eventData);

        eventsProcessed++;
      }

      // Отправляем пачки для каждого счетчика
      if (WiFi.status() == WL_CONNECTED && WiFi.RSSI() > -80 && eventsProcessed > 0) {
        bool allSuccess = true;
        for (int i = 0; i < 3; i++) {
          if (batchTimestamps[i] == 0) continue; // Пропускаем счетчики без событий

          // Формируем путь для пачки (без префикса batch_)
          String batchPath = "/UsersData/";
          batchPath.concat(uid);
          batchPath.concat("/count-");
          batchPath.concat(String(i + 1));
          batchPath.concat("/");
          batchPath.concat(String(batchTimestamps[i]));

          // Отправляем пачку с повторными попытками
          const int maxRetryAttempts = 3;
          int retryAttempt = 0;
          bool success = false;
          while (retryAttempt < maxRetryAttempts && !success) {
            if (Firebase.RTDB.setJSON(&fbdo, batchPath.c_str(), &batchData[i])) {
              DEBUG_PRINT("Batch written to: " + batchPath);
              lastFirebaseWrite = millis();
              success = true;
            } else {
              DEBUG_PRINT("Failed to write batch for counter " + String(i + 1) + " (attempt " + String(retryAttempt + 1) + "): " + fbdo.errorReason());
              if (fbdo.errorReason() == "Permission denied") {
                DEBUG_PRINT("Permission denied, attempting to re-authenticate...");
                Firebase.reconnectWiFi(true);
                Firebase.begin(&config, &auth);
              }
              retryAttempt++;
              delay(2000); // Задержка 2 секунды перед повторной попыткой
            }
          }
          if (!success) {
            allSuccess = false;
            break;
          }
        }

        if (!allSuccess) {
          DEBUG_PRINT("Max retry attempts reached, rolling back queue");
          noInterrupts();
          queueHead = (queueHead - eventsProcessed + QUEUE_SIZE) % QUEUE_SIZE; // Откатываем queueHead
          interrupts();
          break;
        }
      } else if (eventsProcessed > 0) {
        DEBUG_PRINT("WiFi not connected or signal too weak (RSSI: " + String(WiFi.RSSI()) + "), rolling back queue");
        noInterrupts();
        queueHead = (queueHead - eventsProcessed + QUEUE_SIZE) % QUEUE_SIZE; // Откатываем queueHead
        interrupts();
        break;
      }
    }
    if (queueHead == queueTail) {
      queueAttempts = 0; // Сбрасываем счетчик, если очередь пуста
    }
  }
}